## Plan Result (prod_general - TerraformPlanApply)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to import, 11 to add, 3 to change, 9 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.sendgrid-jira-api-key-secret
  * sendgrid_api_key.sendgrid-jira-api-key
* Update
  * azurerm_application_gateway.ag
  * azurerm_key_vault.atlassian_kv
  * azurerm_postgresql_flexible_server.atlassian-flex-server
* Replace
  * terraform_data.vm[&#34;atlassian-prod-confluence-02&#34;]
  * terraform_data.vm[&#34;atlassian-prod-confluence-04&#34;]
  * terraform_data.vm[&#34;atlassian-prod-crowd-01&#34;]
  * terraform_data.vm[&#34;atlassian-prod-gluster-01&#34;]
  * terraform_data.vm[&#34;atlassian-prod-gluster-02&#34;]
  * terraform_data.vm[&#34;atlassian-prod-gluster-03&#34;]
  * terraform_data.vm[&#34;atlassian-prod-jira-01&#34;]
  * terraform_data.vm[&#34;atlassian-prod-jira-02&#34;]
  * terraform_data.vm[&#34;atlassian-prod-jira-03&#34;]
* Import
  * sendgrid_domain_authentication.sendgrid-domain-authenticate




<details><summary>Change Result (Click me)</summary>

```hcl

  # data.azurerm_key_vault_secret.POSTGRES-FLEX-SERVER-PASS will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault_secret" "POSTGRES-FLEX-SERVER-PASS" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.KeyVault/vaults/atlasssian-prod-kv"
      + name                    = "prod-POSTGRES-FLEX-SERVER-PASS"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # data.azurerm_key_vault_secret.POSTGRES-FLEX-SERVER-USER will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault_secret" "POSTGRES-FLEX-SERVER-USER" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.KeyVault/vaults/atlasssian-prod-kv"
      + name                    = "prod-POSTGRES-FLEX-SERVER-USER"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # data.azurerm_key_vault_secret.POSTGRES-SINGLE-SERVER-PASS will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault_secret" "POSTGRES-SINGLE-SERVER-PASS" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.KeyVault/vaults/atlasssian-prod-kv"
      + name                    = "prod-POSTGRES-SINGLE-SERVER-PASS"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # data.azurerm_key_vault_secret.POSTGRES-SINGLE-SERVER-USER will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault_secret" "POSTGRES-SINGLE-SERVER-USER" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.KeyVault/vaults/atlasssian-prod-kv"
      + name                    = "prod-POSTGRES-SINGLE-SERVER-USER"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # data.azurerm_key_vault_secret.admin_private_key will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault_secret" "admin_private_key" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.KeyVault/vaults/atlasssian-prod-kv"
      + name                    = "test-private-key"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # data.azurerm_key_vault_secret.admin_username will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault_secret" "admin_username" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.KeyVault/vaults/atlasssian-prod-kv"
      + name                    = "vm-admin-username"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # azurerm_application_gateway.ag will be updated in-place
  ~ resource "azurerm_application_gateway" "ag" {
        id                                = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Network/applicationGateways/atlassian-prod-app-gateway"
        name                              = "atlassian-prod-app-gateway"
        tags                              = {
            "application"  = "atlassian"
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "production"
        }
        # (8 unchanged attributes hidden)

      - probe {
          - id                                        = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Network/applicationGateways/atlassian-prod-app-gateway/probes/appgw-probe-cnf" -> null
          - interval                                  = 30 -> null
          - minimum_servers                           = 0 -> null
          - name                                      = "appgw-probe-cnf" -> null
          - path                                      = "/confluence" -> null
          - pick_host_name_from_backend_http_settings = true -> null
          - port                                      = 0 -> null
          - protocol                                  = "Http" -> null
          - timeout                                   = 30 -> null
          - unhealthy_threshold                       = 3 -> null
            # (1 unchanged attribute hidden)

          - match {
              - status_code = [
                  - "200-399",
                ] -> null
                # (1 unchanged attribute hidden)
            }
        }
      - probe {
          - id                                        = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Network/applicationGateways/atlassian-prod-app-gateway/probes/appgw-probe-crd" -> null
          - interval                                  = 30 -> null
          - minimum_servers                           = 0 -> null
          - name                                      = "appgw-probe-crd" -> null
          - path                                      = "/crowd" -> null
          - pick_host_name_from_backend_http_settings = true -> null
          - port                                      = 0 -> null
          - protocol                                  = "Http" -> null
          - timeout                                   = 30 -> null
          - unhealthy_threshold                       = 3 -> null
            # (1 unchanged attribute hidden)

          - match {
              - status_code = [
                  - "200-399",
                ] -> null
                # (1 unchanged attribute hidden)
            }
        }
      - probe {
          - id                                        = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Network/applicationGateways/atlassian-prod-app-gateway/probes/appgw-probe-jira" -> null
          - interval                                  = 30 -> null
          - minimum_servers                           = 0 -> null
          - name                                      = "appgw-probe-jira" -> null
          - path                                      = "/jira/status" -> null
          - pick_host_name_from_backend_http_settings = true -> null
          - port                                      = 0 -> null
          - protocol                                  = "Http" -> null
          - timeout                                   = 30 -> null
          - unhealthy_threshold                       = 3 -> null
            # (1 unchanged attribute hidden)

          - match {
              - status_code = [
                  - "200-399",
                ] -> null
                # (1 unchanged attribute hidden)
            }
        }
      + probe {
          + id                                        = (known after apply)
          + interval                                  = 30
          + minimum_servers                           = 0
          + name                                      = "appgw-probe-cnf"
          + path                                      = "/confluence"
          + pick_host_name_from_backend_http_settings = true
          + protocol                                  = "Http"
          + timeout                                   = 30
          + unhealthy_threshold                       = 3
            # (1 unchanged attribute hidden)
        }
      + probe {
          + id                                        = (known after apply)
          + interval                                  = 30
          + minimum_servers                           = 0
          + name                                      = "appgw-probe-crd"
          + path                                      = "/crowd"
          + pick_host_name_from_backend_http_settings = true
          + protocol                                  = "Http"
          + timeout                                   = 30
          + unhealthy_threshold                       = 3
            # (1 unchanged attribute hidden)
        }
      + probe {
          + id                                        = (known after apply)
          + interval                                  = 30
          + minimum_servers                           = 0
          + name                                      = "appgw-probe-jira"
          + path                                      = "/jira/status"
          + pick_host_name_from_backend_http_settings = true
          + protocol                                  = "Http"
          + timeout                                   = 30
          + unhealthy_threshold                       = 3
            # (1 unchanged attribute hidden)
        }

      - request_routing_rule {
          - http_listener_id            = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Network/applicationGateways/atlassian-prod-app-gateway/httpListeners/appgw-http-listener" -> null
          - http_listener_name          = "appgw-http-listener" -> null
          - id                          = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Network/applicationGateways/atlassian-prod-app-gateway/requestRoutingRules/appgw-routing-rule" -> null
          - name                        = "appgw-routing-rule" -> null
          - priority                    = 1 -> null
          - rule_type                   = "PathBasedRouting" -> null
          - url_path_map_id             = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Network/applicationGateways/atlassian-prod-app-gateway/urlPathMaps/appgw-url-map-path" -> null
          - url_path_map_name           = "appgw-url-map-path" -> null
            # (8 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "appgw-backend-pool-cnf"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "appgw-backend-settings-cnf"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "appgw-http-listener"
          + id                          = (known after apply)
          + name                        = "appgw-routing-rule"
          + priority                    = 1
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rule_type                   = "PathBasedRouting"
          + url_path_map_id             = (known after apply)
          + url_path_map_name           = "appgw-url-map-path"
            # (2 unchanged attributes hidden)
        }

        # (18 unchanged blocks hidden)
    }

  # azurerm_key_vault.atlassian_kv will be updated in-place
  ~ resource "azurerm_key_vault" "atlassian_kv" {
      ~ access_policy                   = [
            {
                application_id          = null
                certificate_permissions = []
                key_permissions         = []
                object_id               = "d309fbf5-9c92-470f-a11a-f307cf73fd00"
                secret_permissions      = [
                    "Get",
                    "List",
                    "Set",
                    "Delete",
                    "Purge",
                ]
                storage_permissions     = []
                tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            },
          + {
              + certificate_permissions = []
              + key_permissions         = []
              + object_id               = "d309fbf5-9c92-470f-a11a-f307cf73fd00"
              + secret_permissions      = [
                  + "Get",
                  + "List",
                  + "Set",
                  + "Delete",
                  + "Purge",
                ]
              + storage_permissions     = []
              + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
                # (1 unchanged attribute hidden)
            },
            {
                application_id          = null
                certificate_permissions = [
                    "Get",
                    "List",
                    "Update",
                    "Create",
                    "Import",
                    "Delete",
                    "Recover",
                    "Backup",
                    "Restore",
                    "ManageContacts",
                    "ManageIssuers",
                    "GetIssuers",
                    "ListIssuers",
                    "SetIssuers",
                    "DeleteIssuers",
                ]
                key_permissions         = [
                    "Get",
                    "List",
                    "Update",
                    "Create",
                    "Import",
                    "Delete",
                    "Recover",
                    "Backup",
                    "Restore",
                    "GetRotationPolicy",
                    "SetRotationPolicy",
                    "Rotate",
                ]
                object_id               = "e7ea2042-4ced-45dd-8ae3-e051c6551789"
                secret_permissions      = [
                    "Get",
                    "List",
                    "Set",
                    "Delete",
                    "Purge",
                ]
                storage_permissions     = []
                tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            },
            # (2 unchanged elements hidden)
        ]
        id                              = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.KeyVault/vaults/atlasssian-prod-kv"
        name                            = "atlasssian-prod-kv"
        tags                            = {
            "application"  = "atlassian"
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "production"
        }
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_key_vault_secret.sendgrid-jira-api-key-secret will be created
  + resource "azurerm_key_vault_secret" "sendgrid-jira-api-key-secret" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.KeyVault/vaults/atlasssian-prod-kv"
      + name                    = "jira-email-sendgrid-api-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + value_wo                = (write-only attribute)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_postgresql_flexible_server.atlassian-flex-server will be updated in-place
  ~ resource "azurerm_postgresql_flexible_server" "atlassian-flex-server" {
      ~ administrator_password            = (sensitive value)
        id                                = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/atlassian-prod-flex-server"
        name                              = "atlassian-prod-flex-server"
        tags                              = {
            "application"  = "atlassian"
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "production"
        }
        # (18 unchanged attributes hidden)

      ~ authentication {
          + tenant_id                     = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            # (2 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # sendgrid_api_key.sendgrid-jira-api-key will be created
  + resource "sendgrid_api_key" "sendgrid-jira-api-key" {
      + api_key = (sensitive value)
      + id      = (known after apply)
      + name    = "jira-email-prod-api"
      + scopes  = [
          + "2fa_exempt",
          + "2fa_required",
          + "mail.batch.create",
          + "mail.batch.delete",
          + "mail.batch.read",
          + "mail.batch.update",
          + "mail.send",
          + "sender_verification_eligible",
          + "user.scheduled_sends.create",
          + "user.scheduled_sends.delete",
          + "user.scheduled_sends.read",
          + "user.scheduled_sends.update",
          + "whitelabel.create",
          + "whitelabel.delete",
          + "whitelabel.read",
          + "whitelabel.update",
        ]
    }

  # sendgrid_domain_authentication.sendgrid-domain-authenticate will be imported
    resource "sendgrid_domain_authentication" "sendgrid-domain-authenticate" {
        custom_dkim_selector = null
        custom_spf           = false
        dns                  = [
            {
                data  = "s1.domainkey.u51930430.wl181.sendgrid.net"
                host  = "s1._domainkey.cjscp.justice.gov.uk"
                type  = "cname"
                valid = true
            },
            {
                data  = "s2.domainkey.u51930430.wl181.sendgrid.net"
                host  = "s2._domainkey.cjscp.justice.gov.uk"
                type  = "cname"
                valid = true
            },
            {
                data  = "u51930430.wl181.sendgrid.net"
                host  = "em1187.cjscp.justice.gov.uk"
                type  = "cname"
                valid = true
            },
        ]
        domain               = "cjscp.justice.gov.uk"
        id                   = "25482485"
        ips                  = []
        is_default           = false
        subdomain            = "em1187"
        username             = "azure_acct_30ef49a32e6e3b659a7b198162c4663a761ef12e"
        valid                = true
    }

  # terraform_data.vm["atlassian-prod-confluence-02"] must be replaced
-/+ resource "terraform_data" "vm" {
      ~ id               = "f98a5c12-524e-30f3-ec5f-9aabc21827de" -> (known after apply)
      ~ triggers_replace = [
          ~ "58bc2f37238728baace3331d9858962a" -> "c0eba1f3c45c68bcc364a8f88f972cd5",
            "15afea25b6d128671e9ba868905c6c9e",
          ~ "a9a6191b0542bc69b6410ee3efc5ae60" -> "6c1d05f90513fda6f3a9536c6593ca12",
            "4d04a56ef3bff64a2a1fec36659c6c33",
            # (2 unchanged elements hidden)
        ]
    }

  # terraform_data.vm["atlassian-prod-confluence-04"] must be replaced
-/+ resource "terraform_data" "vm" {
      ~ id               = "06ff0d0a-162f-0117-cdaa-60adf7127b87" -> (known after apply)
      ~ triggers_replace = [
          ~ "58bc2f37238728baace3331d9858962a" -> "c0eba1f3c45c68bcc364a8f88f972cd5",
            "15afea25b6d128671e9ba868905c6c9e",
          ~ "a9a6191b0542bc69b6410ee3efc5ae60" -> "6c1d05f90513fda6f3a9536c6593ca12",
            "4d04a56ef3bff64a2a1fec36659c6c33",
            # (2 unchanged elements hidden)
        ]
    }

  # terraform_data.vm["atlassian-prod-crowd-01"] must be replaced
-/+ resource "terraform_data" "vm" {
      ~ id               = "f6bfba83-097c-cf6d-c4b4-cd3295ce5ba4" -> (known after apply)
      ~ triggers_replace = [
          ~ "58bc2f37238728baace3331d9858962a" -> "c0eba1f3c45c68bcc364a8f88f972cd5",
            "15afea25b6d128671e9ba868905c6c9e",
          ~ "a9a6191b0542bc69b6410ee3efc5ae60" -> "6c1d05f90513fda6f3a9536c6593ca12",
            "4d04a56ef3bff64a2a1fec36659c6c33",
            # (2 unchanged elements hidden)
        ]
    }

  # terraform_data.vm["atlassian-prod-gluster-01"] must be replaced
-/+ resource "terraform_data" "vm" {
      ~ id               = "92d93b6b-7683-5166-52db-6e3f5acdb098" -> (known after apply)
      ~ triggers_replace = [
          ~ "58bc2f37238728baace3331d9858962a" -> "c0eba1f3c45c68bcc364a8f88f972cd5",
            "15afea25b6d128671e9ba868905c6c9e",
          ~ "a9a6191b0542bc69b6410ee3efc5ae60" -> "6c1d05f90513fda6f3a9536c6593ca12",
            "4d04a56ef3bff64a2a1fec36659c6c33",
            # (2 unchanged elements hidden)
        ]
    }

  # terraform_data.vm["atlassian-prod-gluster-02"] must be replaced
-/+ resource "terraform_data" "vm" {
      ~ id               = "1710bfe9-dfe0-e062-5e60-4f845b919a0c" -> (known after apply)
      ~ triggers_replace = [
          ~ "58bc2f37238728baace3331d9858962a" -> "c0eba1f3c45c68bcc364a8f88f972cd5",
            "15afea25b6d128671e9ba868905c6c9e",
          ~ "a9a6191b0542bc69b6410ee3efc5ae60" -> "6c1d05f90513fda6f3a9536c6593ca12",
            "4d04a56ef3bff64a2a1fec36659c6c33",
            # (2 unchanged elements hidden)
        ]
    }

  # terraform_data.vm["atlassian-prod-gluster-03"] must be replaced
-/+ resource "terraform_data" "vm" {
      ~ id               = "63aa4a38-5188-688a-8553-0f1046d4b3d5" -> (known after apply)
      ~ triggers_replace = [
          ~ "58bc2f37238728baace3331d9858962a" -> "c0eba1f3c45c68bcc364a8f88f972cd5",
            "15afea25b6d128671e9ba868905c6c9e",
          ~ "a9a6191b0542bc69b6410ee3efc5ae60" -> "6c1d05f90513fda6f3a9536c6593ca12",
            "4d04a56ef3bff64a2a1fec36659c6c33",
            # (2 unchanged elements hidden)
        ]
    }

  # terraform_data.vm["atlassian-prod-jira-01"] must be replaced
-/+ resource "terraform_data" "vm" {
      ~ id               = "6db49e3b-740b-0e71-679e-57aa6fc22926" -> (known after apply)
      ~ triggers_replace = [
          ~ "58bc2f37238728baace3331d9858962a" -> "c0eba1f3c45c68bcc364a8f88f972cd5",
            "15afea25b6d128671e9ba868905c6c9e",
          ~ "a9a6191b0542bc69b6410ee3efc5ae60" -> "6c1d05f90513fda6f3a9536c6593ca12",
            "4d04a56ef3bff64a2a1fec36659c6c33",
            # (2 unchanged elements hidden)
        ]
    }

  # terraform_data.vm["atlassian-prod-jira-02"] must be replaced
-/+ resource "terraform_data" "vm" {
      ~ id               = "3af907b5-5614-78bc-8a4f-1068e6c48c5d" -> (known after apply)
      ~ triggers_replace = [
          ~ "58bc2f37238728baace3331d9858962a" -> "c0eba1f3c45c68bcc364a8f88f972cd5",
            "15afea25b6d128671e9ba868905c6c9e",
          ~ "a9a6191b0542bc69b6410ee3efc5ae60" -> "6c1d05f90513fda6f3a9536c6593ca12",
            "4d04a56ef3bff64a2a1fec36659c6c33",
            # (2 unchanged elements hidden)
        ]
    }

  # terraform_data.vm["atlassian-prod-jira-03"] must be replaced
-/+ resource "terraform_data" "vm" {
      ~ id               = "e4f2a3d5-76e2-fa48-c3ae-a1a6056b215b" -> (known after apply)
      ~ triggers_replace = [
          ~ "58bc2f37238728baace3331d9858962a" -> "c0eba1f3c45c68bcc364a8f88f972cd5",
            "15afea25b6d128671e9ba868905c6c9e",
          ~ "a9a6191b0542bc69b6410ee3efc5ae60" -> "6c1d05f90513fda6f3a9536c6593ca12",
            "4d04a56ef3bff64a2a1fec36659c6c33",
            # (2 unchanged elements hidden)
        ]
    }

Plan: 1 to import, 11 to add, 3 to change, 9 to destroy.

Changes to Outputs:
  + sendgrid_dns_records = {
      + record1 = {
          + data = "s1.domainkey.u51930430.wl181.sendgrid.net"
          + host = "s1._domainkey.cjscp.justice.gov.uk"
        }
      + record2 = {
          + data = "s2.domainkey.u51930430.wl181.sendgrid.net"
          + host = "s2._domainkey.cjscp.justice.gov.uk"
        }
      + record3 = {
          + data = "u51930430.wl181.sendgrid.net"
          + host = "em1187.cjscp.justice.gov.uk"
        }
    }
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":107,"Program":"tfcmt","SHA1":"","Target":"prod_general - TerraformPlanApply","Vars":{}} -->